icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
/************************************************************
 * Copyright (C), 2008-2012,
 * FileName:		// 文件名
 * Author:			// 作者
 * Date:			// 日期
 * Description:		// 模块描述
 * Version:			// 版本信息
 * Function List:	// 主要函数及其功能
 *     1. -------
 * History:			// 历史修改记录
 *     <author>  <time>   <version >   <desc>
 *     David    96/10/12     1.0     build this moudle
 ***********************************************************/
#include <stdio.h>
#include <rtthread.h>
#include <rtdevice.h>
#include <dfs_posix.h>

#include "stm32f4xx.h"
#include "jt808.h"
#include <finsh.h>
#include "sst25.h"
#include "math.h"
#include "jt808_param.h"
#include "jt808_gps.h"
#include "camera.h"
#include "jt808_config.h"


#define DF_LINESaveSect			0x1000      ///路线数据存储最小间隔
#define DF_AreaSaveSect			0x40        ///电子围栏数据存储最小间隔

#define AREA_ALARM_NUM 24

#define AREANUM 24

#define LINENUM 20

#define AREA_BUF_SIZE	4096
#define LINE_BUF_SIZE	4096

#define WLENGH 111200       ///每个纬度的距离，该值为固定值单位为米

#define JLENGH 111320       ///赤道上每个经度的距离，单位为米

#ifndef BIT
#define BIT( i ) ( (unsigned long)( 1 << i ) )
#endif

typedef enum
{
	AREA_None = 0,                              ///无数据
	AREA_Circular,                              ///圆形
	AREA_Rectangle,                             ///矩形
	AREA_Polygon,                               ///多边形
	AREA_Line,                                  ///线路
}ENUM_AREA;

typedef __packed struct                         ///定义了一个坐标
{
	u32 Lati;                                   ///地球坐标纬度
	u32 Longi;                                  ///地球坐标经度
}TypeStruct_Coor;

typedef __packed struct
{
	u8	alarm_bit;                              ///该数最高位表示是否删除，为0表示删除，为1表示没有删除，其它7bit组成的数字表示报警值，从0~31表示不同的报警bit位
	u8	attri_id;                               ///附加信息 ID，为0表示无数据
	u8	len;                                    ///附加信息长度
	u8	data[7];                                ///报警附加信息,最大为7字节，详见JT808协议表27
}Type_AREA_ALARM;
 
typedef __packed struct
{
	char			Head[4];                    ///幻数部分，表示当前数据区域为某固定数据开始
	u16				Len;                        ///数据长度，包括数据头部分内容
	ENUM_AREA		State;                      ///区域类型，如果为AREA_None表示无数据
	TypeStruct_Coor Rect_left;                  ///区域外围矩形->左上角经纬度
	TypeStruct_Coor Rect_right;                 ///区域外围矩形->右下角经纬度
	u32				ID;                         ///区域ID
	u8				Data[1];                    ///区域
}TypeDF_AreaHead;

typedef __packed struct
{
	TypeDF_AreaHead *area_data;                 ///电子围栏数据指针
	u8				in_area;                    ///在区域里面的内部标记,0表示不在该区域,1表示在
	u32				in_area_utc;                ///进入该区域的时间，单位为S
	u32				speed_utc;                  ///超速的时间，单位为S
	u8				speed;                      ///超速标记，为0表示没有超速，为1表示超速
}Type_AreaInfo;

typedef __packed struct
{
	TypeDF_AreaHead line_head;                  ///线路数据包头
	u8				*line_data;                 ///线路数据指针
	u8				in_area;                    ///在区域里面的内部标记0表示不在该区域
	u32				in_area_utc;                ///进入该区域的时间，单位为S
	u32				road_speed_utc;             ///超时的时间，单位为S
	u32				road_id;                    ///当前所在的路段ID
	u32				road_in_utc;                ///进入该路段的时间，单位为S
	u32				road_timer_max;             ///路段行驶过长阈值，单位为S
	u32				road_timer_min;             ///路段行驶不足阈值，单位为S
	u8				deviate;                    ///路段偏离，为0表示没有偏离，为1表示偏离
	u8				speed;                      ///超速标记，为0表示没有超速，为1表示超速
}Type_LineInfo;

typedef __packed struct
{
	u16				area_len;                   ///电子围栏数据使用长度
	u16				line_len;                   ///线路数据使用长度
	u8				area_num;                   ///电子围栏数量
	u8				line_num;                   ///线路数量
	Type_AreaInfo	area_info[AREANUM];         ///电子围栏参数及数据
	Type_LineInfo	line_info[LINENUM];         ///线路参数及数据
}Type_AreaPara;

static Type_AREA_ALARM 	area_alarm_array[AREA_ALARM_NUM];	//最多支持32个附加消息

static u8			area_buffer[AREA_BUF_SIZE]; ///存储电子围栏的数据区域
static u8			line_buffer[LINE_BUF_SIZE]; ///存储线路的数据区域

static const char	AREA_HEAD[] = { "AREA" };
Type_AreaPara		Area_Para;

/* 消息队列控制块，用于电子围栏和线路报警事件的处理*/
struct rt_messagequeue	mq_area;
/* 消息队列中用到的放置消息的内存池*/
//static char				msgpool_area[256];

static u16				test_speed;


/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8600(uint16_t fram_num,uint8_t *pmsg,u16 msg_len)
  *功能描述:计算指定的纬度上每个经度的长度.
  *输	入:	latitude:当前纬度值，单位为百万分之一度
  *输	出:none
  *返 回 值:double  :返回实际每个经度的长度，单位为米
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
double Cal_Longi_Distance( u32 latitude )
{
	double	dx, dy;
	double	tempd;
	//u8 tempbuf[128];
	double	pi = 3.1415926;

	tempd	= latitude;
	dy		= ( tempd / 1000000 / 180 ) * pi;
	dx		= JLENGH * cos( dy );
	//sprintf(tempbuf,"\r\n dx=%f\r\n",dx);
	//rt_kprintf(tempbuf);
	return dx;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8600(uint16_t fram_num,uint8_t *pmsg,u16 msg_len)
  *功能描述:计算指定的纬度上每个经度的长度，然后根据用户输入的距离计算对应的经度数，单位为
   以度为单位的经度值乘以 10 的 6 次方，精确到百万分之一度
  *输	入:	latitude:当前纬度值，单位为百万分之一度
   distance:用户输入的距离
  *输	出:none
  *返 回 值:u32     :返回实际的经度数
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 dis_to_Longi( u32 latitude, u32 distance )
{
	u32		tempu32data;
	double	tempd;
	//u8 tempbuf[128];

	tempd		= distance;
	tempu32data = tempd * 1000000 / Cal_Longi_Distance( latitude );
	tempu32data++;
	//sprintf(tempbuf,"\r\n longitude=%d\r\n",tempu32data);
	//rt_kprintf(tempbuf);
	return tempu32data;
}

/*********************************************************************************
  *函数名称:u32 AnglPoint2Point(s32 Lati_0,s32 Longi_0,s32 Lati_1,s32 Longi_1)
  *功能描述:计算两点之间的距离，
  *输	入:	Lati_1	:第一个点的纬度，单位为百万分之一度
   Longi_1	:第一个点的经度，单位为百万分之一度
   Lati_2	:第二个点的纬度，单位为百万分之一度
   Longi_2	:第二个点的经度，单位为百万分之一度
  *输	出:none
  *返 回 值:u32     :返回实际的距离，单位为米
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 AnglPoint2Point( s32 Lati_0, s32 Longi_0, s32 Lati_1, s32 Longi_1 )
{
	s32		temps32data;
	double	tempd1;
	double	x, y;
	//u8 tempbuf[128];

	x	= Longi_1 - Longi_0;
	y	= Lati_1 - Lati_0;
	if( y == 0 )
	{
		if( x >= 0 )
		{
			temps32data = 0;
		} else
		{
			temps32data = 180;
		}
	}else if( x == 0 )
	{
		if( y > 0 )
		{
			temps32data = 90;
		} else
		{
			temps32data = 270;
		}
	}else
	{
		tempd1		= atan2( y, x );
		temps32data = tempd1 * 180 / 3.1415926;
		if( temps32data < 0 )
		{
			temps32data += 360;
		}
	}
	//rt_kprintf("Angle = %d",temps32data);
	return temps32data;
}

