icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
FINSH_FUNCTION_EXPORT( AnglPoint2Point, AnglPoint2Point );


/*********************************************************************************
  *函数名称:u32 dis_Point2Point(s32 Lati_1,s32 Longi_1,s32 Lati_2,s32 Longi_2)
  *功能描述:计算两点之间的距离，
  *输	入:	Lati_1	:第一个点的纬度，单位为百万分之一度
   Longi_1	:第一个点的经度，单位为百万分之一度
   Lati_2	:第二个点的纬度，单位为百万分之一度
   Longi_2	:第二个点的经度，单位为百万分之一度
  *输	出:none
  *返 回 值:u32     :返回实际的距离，单位为米
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 dis_Point2Point( s32 Lati_1, s32 Longi_1, s32 Lati_2, s32 Longi_2 )
{
	s32		temps32data;
	double	tempd1, tempd2;

	//rt_kprintf("\r\n Lati_1= %d,Longi_1= %d,Lati_2= %d,Longi_2= %d",Lati_1,Longi_1,Lati_2,Longi_2);

	temps32data = abs( Lati_1 + Lati_2 );
	tempd1		= Cal_Longi_Distance( temps32data / 2 );
	tempd1		*= abs( Longi_1 - Longi_2 );
	tempd1		/= 1000000.0;
	tempd2		= WLENGH;
	tempd2		*= abs( Lati_1 - Lati_2 );
	tempd2		/= 1000000;

	tempd2	*= tempd2;
	tempd1	*= tempd1;

	temps32data = sqrt( tempd1 + tempd2 );
	//rt_kprintf("dis = %d",temps32data);
	return (u32)temps32data;
}

FINSH_FUNCTION_EXPORT( dis_Point2Point, dis_Point2Point );


/*********************************************************************************
  *函数名称:u32 dis_Point2Line(u32 Cur_Lati, u32 Cur_Longi,u32 Lati_1,u32 Longi_1,u32 Lati_2,u32 Longi_2)
  *功能描述:计算点到线之间的距离，
  *输	入:	Cur_Lati	:当前点的纬度，单位为百万分之一度
   Cur_Longi	:当前点的经度，单位为百万分之一度
   Lati_1		:第一个点的纬度，单位为百万分之一度
   Longti_1	:第一个点的经度，单位为百万分之一度
   Lati_2		:第二个点的纬度，单位为百万分之一度
   Longti_2	:第二个点的经度，单位为百万分之一度
  *输	出:none
  *返 回 值:u32     :返回实际的距离，单位为米
  *作	者:白养民
  *创建日期:2013-06-16
  *数学原形:	1、当前处理的线条的函数为		y = a*x;
   2、和这个线条垂直的线条的函数为	y1= -(1/a)*x1 + b;
   3、首先计算出:  a,b及1/a，然后根据这三个值计算出两条线条相交的点的X轴坐标
    有公式	a*x	= -(1/a)*x + b;   因此  x2 = b / (a + 1/a),
   4、根据x2坐标计算y2坐标，y = a * x,然后计算这个点到当前点的距离，同时计算这个点
    是否在两点组成的线中间，是则返回正数，否则返回负数
   5、注意，所有的点的计算都以Lati_1和Longi_1作为原点,经度为x轴，纬度为y轴
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 dis_Point2Line( s32 Cur_Lati, s32 Cur_Longi, s32 Lati_1, s32 Longi_1, s32 Lati_2, s32 Longi_2 )
{
	double	x, y, x1, y1, x2, y2;
	s32		temp_lati, temp_longi;
	double	a, a1, b;
	u32		tempu32data;
	//u8 tempbuf[128];

	y1	= Cur_Lati - Lati_1;
	x1	= Cur_Longi - Longi_1;
	y	= Lati_2 - Lati_1;
	x	= Longi_2 - Longi_1;

	//sprintf(tempbuf,"\r\n x=%f,y=%f,x1=%f,y1=%f ",x,y,x1,y1);
	//rt_kprintf(tempbuf);

	if( x == 0 )
	{
		x2	= 0;
		y2	= y1;
	}else if( y == 0 )
	{
		x2	= x1;
		y2	= 0;
	}else
	{
		a	= y / x;
		a1	= x / y;
		b	= y1 + a1 * x1;
		x2	= b / ( a + a1 );
		y2	= a * x2;
	}

	temp_lati	= y2 + Lati_1;
	temp_longi	= x2 + Longi_1;

	//sprintf(tempbuf,"\r\n x2=%f,y2=%f,temp_longi=%d,temp_lati=%d ",x2,y2,temp_longi,temp_lati);
	//rt_kprintf(tempbuf);
	if( ( ( x >= 0 && x2 >= 0 ) || ( x <= 0 && x2 <= 0 ) ) && ( ( y >= 0 && y2 >= 0 ) || ( y <= 0 && y2 <= 0 ) ) )
	{
		if( ( abs( x2 ) <= abs( x ) ) && ( abs( y2 ) <= abs( y ) ) )
		{
			tempu32data = dis_Point2Point( temp_lati, temp_longi, Cur_Lati, Cur_Longi );
			//rt_kprintf("dis = %d",tempu32data);
			return tempu32data;
		}
	}
	return 0xFFFFFFFF;
}

FINSH_FUNCTION_EXPORT( dis_Point2Line, dis_Point2Line );


/*********************************************************************************
  *函数名称:u8 Check_CooisInRect(TypeStruct_Coor *pCoo, TypeDF_AreaHead *pHead )
  *功能描述:判断当前位置是否在该矩形区域里面
  *输	入:	pCoo	:当前位置坐标
   pHead	:当前矩形区域
  *输	出:none
  *返 回 值:u8	1:表示在该区域，	0:表示不在该区域
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 Check_CooisInRect( TypeStruct_Coor *pCoo, TypeDF_AreaHead *pHead )
{
	if( ( pCoo->Lati > pHead->Rect_left.Lati ) || ( pCoo->Longi < pHead->Rect_left.Longi ) )
	{
		return 0;
	}
	if( ( pCoo->Lati < pHead->Rect_right.Lati ) || ( pCoo->Longi > pHead->Rect_right.Longi ) )
	{
		return 0;
	}
	return 1;
}

/*********************************************************************************
  *函数名称:u8 Check_Area_Time(u8 * StartTime,u8 *EndTime)
  *功能描述:判断当前时间是否在指定时间段里面，用于808协议的电子围栏和线路时间比较
  *输	入:	StartTime	:开始时间
   EndTime		:结束时间
  *输	出:none
  *返 回 值:u8	1:表示在该时间段，	0:表示不在该时间段
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 Check_Area_Time( u8 * StartTime, u8 *EndTime )
{
	MYTIME	start;
	MYTIME	end;

	start	= mytime_from_bcd( StartTime );
	end		= mytime_from_bcd( EndTime );

	if( ( mytime_now >= start ) && ( mytime_now < end ) )
	{
		return 1;
	}
	return 0;
}

/*********************************************************************************
  *函数名称:u8 Check_Angle(u32 angle,u32 angle_start,u32 angle_end )
  *功能描述:判断当前角度是否在指定的角度里面，指定的角度是按照逆时针方式旋转的
  *输	入:	angle		:当前的角度
   StartTime	:起始角度值
   EndTime		:结束角度值
  *输	出:none
  *返 回 值:u8	1:表示在该角度范围	0:表示不在该角度范围
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 Check_Angle( u32 angle, u32 angle_start, u32 angle_end )
{
	if( angle_start > angle_end )
	{
		if( ( angle > angle_end ) && ( angle < angle_start ) )
		{
			return 0;
		}else
		{
			return 1;
		}
	}else
	{
		if( ( angle >= angle_start ) && ( angle <= angle_end ) )
		{
			return 1;
		}else
		{
			return 0;
		}
	}
}

/*********************************************************************************
  *函数名称:u16 area_flash_read_area( u8 *pdest,u16 maxlen)
  *功能描述:读取flash中的电子围栏到全局变量参数 Area_Para中
  *输	入:	pdatabuf	:将要保存电子围栏数据的ram区域
   maxlen		:pdatabuf的长度，告诉函数防止溢出
  *输	出:	none
  *返 回 值:u16	0:发生了溢出	1:正常返回
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 area_flash_read_area( u8 *pdatabuf, u16 maxlen )
{
	u8				*ptempbuf = pdatabuf;
	u32				TempAddress;
	TypeDF_AreaHead TempAreaHead;
	u16				ret = 0;

	Area_Para.area_len	= 0;
	Area_Para.area_num	= 0;
	memset( pdatabuf, 0, maxlen );
	memset( (void*)( Area_Para.area_info ), 0, sizeof( Area_Para.area_info ) );

	for( TempAddress = ADDR_DF_AREA_START; TempAddress < ADDR_DF_AREA_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State ) )
		{
			///如果buf长度不够或者已经读取到得区域总数量超过AREANUM，则直接返回0，表示溢出
			if( ( TempAreaHead.Len > maxlen - Area_Para.area_len ) || ( Area_Para.area_num >= AREANUM ) )
			{
				ret = 0; goto FUNC_RET;
			}
			sst25_read( TempAddress, ptempbuf + Area_Para.area_len, TempAreaHead.Len );
			Area_Para.area_info[Area_Para.area_num++].area_data = (TypeDF_AreaHead*)( ptempbuf + Area_Para.area_len );
			Area_Para.area_len									+= TempAreaHead.Len;
			TempAddress											+= ( TempAreaHead.Len + DF_AreaSaveSect - 1 ) / DF_AreaSaveSect * DF_AreaSaveSect;
		}else
		{
			TempAddress += DF_AreaSaveSect;
		}
	}
	ret = 1;
FUNC_RET:
	return ret;
}

/*********************************************************************************
  *函数名称:u16 area_flash_read_line( u8 *pdest,u16 maxlen)
  *功能描述:读取flash中的线路参数到全局变量参数 Area_Para中
  *输	入:	pdatabuf	:将要保存线路数据的ram区域
   maxlen		:pdatabuf的长度，告诉函数防止溢出
  *输	出:	none
  *返 回 值:u16	0:发生了溢出	1:正常返回
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 area_flash_read_line( u8 *pdatabuf, u16 maxlen )
{
	u8				*ptempbuf = pdatabuf;
	u32				TempAddress;
	u16				sublen; ///flash存储增加的包头部分的长度
	TypeDF_AreaHead TempAreaHead;
	u16				ret = 0;

