icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
	sublen = sizeof( TypeDF_AreaHead ) - 5;

	Area_Para.line_len	= 0;
	Area_Para.line_num	= 0;
	memset( pdatabuf, 0, maxlen );
	memset( &Area_Para.line_info, 0, sizeof( Area_Para.line_info ) );

	for( TempAddress = ADDR_DF_LINE_START; TempAddress < ADDR_DF_LINE_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State == AREA_Line ) )
		{
			///如果已经读取到得区域总数量超过LINENUM，则直接返回0，表示溢出
			if( Area_Para.line_num >= LINENUM )
			{
				ret = 0; goto FUNC_RET;
			}
			memcpy( &Area_Para.line_info[Area_Para.line_num].line_head, &TempAreaHead, sizeof( TypeDF_AreaHead ) );
			///如果buf长度不够则不填充数据到数据buf中
			if( TempAreaHead.Len - sublen <= maxlen - Area_Para.line_len )
			{
				sst25_read( TempAddress + sublen, ptempbuf + Area_Para.line_len, TempAreaHead.Len - sublen );
				Area_Para.line_info[Area_Para.line_num].line_data	= ptempbuf + Area_Para.line_len;
				Area_Para.line_len									+= TempAreaHead.Len - sublen;
			}
			Area_Para.line_num++;
		}
		TempAddress += DF_LINESaveSect;
	}

	ret = 1;
FUNC_RET:
	return ret;
}

/*********************************************************************************
  *函数名称:u16 area_flash_get_line_data( u8 *pdatabuf, u16 maxlen, Type_LineInfo *AreaInfo)
  *功能描述:读取flash中的线路数据到AreaInfo中，该函数也会修改全局参数 Area_Para.line_info 的数据指针line_data
  *输	入:	pdatabuf	:将要保存线路数据的ram区域
   maxlen		:pdatabuf的长度，告诉函数防止溢出
   AreaInfo	:
  *输	出:	none
  *返 回 值:u16	0:发生了溢出	1:正常返回
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 area_flash_get_line_data( u8 *pdatabuf, u16 maxlen, Type_LineInfo *AreaInfo )
{
	u32				i;
	u8				*ptempbuf = pdatabuf;
	u32				TempAddress;
	u16				sublen; ///flash存储增加的包头部分的长度
	TypeDF_AreaHead TempAreaHead;
	u16				ret = 0;

	sublen = sizeof( TypeDF_AreaHead ) - 5;

	///如果buf长度不够则将buf清空，并且将全局参数Area_Para.line_info[i].line_data 全部清空
	if( TempAreaHead.Len - sublen > maxlen - Area_Para.line_len )
	{
		Area_Para.line_len = 0;
		memset( pdatabuf, 0, maxlen );
		for( i = 0; i < LINENUM; i++ )
		{
			Area_Para.line_info[i].line_data = RT_NULL;
		}
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_LINE_START; TempAddress < ADDR_DF_LINE_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State == AREA_Line ) )
		{
			///如果已经读取到得区域总数量超过LINENUM，则直接返回0，表示溢出
			if( Area_Para.line_num >= LINENUM )
			{
				ret = 0; goto FUNC_RET;
			}
			///如果当前读取到得ID和要处理的ID相同
			if( TempAreaHead.ID == AreaInfo->line_head.ID )
			{
				//如果buf长度够则填充数据到数据buf中
				if( TempAreaHead.Len - sublen <= maxlen - Area_Para.line_len )
				{
					sst25_read( TempAddress + sublen, ptempbuf + Area_Para.line_len, TempAreaHead.Len - sublen );
					Area_Para.line_info[Area_Para.line_num].line_data	= ptempbuf + Area_Para.line_len;
					Area_Para.line_len									+= TempAreaHead.Len - sublen;
					ret													= 1;
				}else
				{
					ret = 0;
				}
				goto FUNC_RET;
			}
			Area_Para.line_num++;
		}
		TempAddress += DF_LINESaveSect;
	}
	ret = 0;
FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:u16 area_flash_write_area( u8 *pdatabuf,u16 maxlen,TypeDF_AreaHead *pData)
  *功能描述:读取flash中的电子围栏到全局变量参数 Area_Para中
  *输	入:	pdatabuf	:将要保存电子围栏数据的ram区域
   maxlen		:pdatabuf的长度，告诉函数防止溢出
   pData		:将要存入的电子围栏数据
  *输	出:	none
  *返 回 值:u16	0:发生了溢出	1:正常返回
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 area_flash_write_area( u8 *pdatabuf, u16 maxlen, TypeDF_AreaHead *pData )
{
	u8				i;
	u8				*ptempbuf = pdatabuf;
	u32				TempAddress;
	TypeDF_AreaHead TempAreaHead;
	u16				ret = 0;

	if( ( pData->State == 0 ) || ( pData->State > AREA_Polygon ) )
	{
		return 0;
	}
	if( ( pData->Len > maxlen - Area_Para.area_len ) || ( Area_Para.area_num >= AREANUM ) )
	{
		return 0;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	///处理修改电子围栏区域命令
	for( TempAddress = ADDR_DF_AREA_START; TempAddress < ADDR_DF_AREA_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State ) )
		{
			if( ( pData->Len == TempAreaHead.Len ) && ( pData->ID == TempAreaHead.ID ) )
			{
				sst25_write_back( TempAddress, (u8*)pData, pData->Len );
				area_flash_read_area( area_buffer, AREA_BUF_SIZE );
				ret = 1; goto FUNC_RET;
			}
			TempAddress += ( TempAreaHead.Len + DF_AreaSaveSect - 1 ) / DF_AreaSaveSect * DF_AreaSaveSect;
		}else
		{
			TempAddress += DF_AreaSaveSect;
		}
	}
	///处理增加电子围栏区域
	memcpy( ptempbuf + Area_Para.area_len, pData, pData->Len );
	Area_Para.area_info[Area_Para.area_num++].area_data = (TypeDF_AreaHead*)( ptempbuf + Area_Para.area_len );
	Area_Para.area_len									+= pData->Len;

	///擦除电子围栏区域flash
	for( TempAddress = ADDR_DF_AREA_START; TempAddress < ADDR_DF_AREA_END; TempAddress += 0x1000 )
	{
		sst25_erase_4k( TempAddress );
	}
	TempAddress = ADDR_DF_AREA_START;
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		if( TempAddress + Area_Para.area_info[i].area_data->Len > ADDR_DF_AREA_END )
		{
			ret = 0; goto FUNC_RET;
		}
		sst25_write_through( TempAddress, (u8*)Area_Para.area_info[i].area_data, Area_Para.area_info[i].area_data->Len );
		TempAddress += ( Area_Para.area_info[i].area_data->Len + DF_AreaSaveSect - 1 ) / DF_AreaSaveSect * DF_AreaSaveSect;
	}

	ret = 1;
FUNC_RET:
	rt_sem_release( &sem_dataflash );
	return ret;
}

/*********************************************************************************
  *函数名称:u16 area_flash_write_line( u8 *pdatabuf,u16 maxlen,TypeDF_AreaHead *pData)
  *功能描述:向flash中存入线路
  *输	入:	pdatabuf	:将要保存电子围栏数据的ram区域
   maxlen		:pdatabuf的长度，告诉函数防止溢出
   pData		:将要存入的线路数据
  *输	出:	none
  *返 回 值:u16	0:发生了溢出	1:正常返回
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u16 area_flash_write_line( u8 *pdatabuf, u16 maxlen, TypeDF_AreaHead *pData )
{
	u8				i;
	u32				TempAddress;
	TypeDF_AreaHead TempAreaHead;

	if( ( pData->State == 0 ) || ( pData->State != AREA_Line ) )
	{
		return 0;
	}
	if( Area_Para.line_num >= LINENUM )
	{
		return 0;
	}
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	TempAddress = ADDR_DF_LINE_START;
	for( i = 0; i < LINENUM; i++ )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) ) || ( TempAreaHead.State == 0 ) )
		{
			sst25_write_back( TempAddress, (u8*)pData, pData->Len );
			break;
		}

		TempAddress += DF_LINESaveSect;
	}

	area_flash_read_line( line_buffer, LINE_BUF_SIZE );

	rt_sem_release( &sem_dataflash );
	return 1;
}

/*********************************************************************************
  *函数名称:void area_flash_del_area( u32 del_id , ENUM_AREA	del_State)
  *功能描述:删除指定类型的电子围栏
  *输	入:	del_id		:将要删除的电子围栏ID，如果该值为0表示删除所有指定类型的电子围栏
   del_State	:将要删除的电子围栏类型
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_flash_del_area( u32 del_id, ENUM_AREA del_State )
{
	u32				TempAddress;
	TypeDF_AreaHead TempAreaHead;

	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_AREA_START; TempAddress < ADDR_DF_AREA_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State ) )
		{
			if( ( ( TempAreaHead.ID == del_id ) || ( 0 == del_id ) ) && ( del_State == TempAreaHead.State ) )
			{
				TempAreaHead.State = AREA_None;
				sst25_write_through( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
			}
			TempAddress += ( TempAreaHead.Len + DF_AreaSaveSect - 1 ) / DF_AreaSaveSect * DF_AreaSaveSect;
		}else
		{
			TempAddress += DF_AreaSaveSect;
		}
	}
	area_flash_read_area( area_buffer, AREA_BUF_SIZE );
	rt_sem_release( &sem_dataflash );
}

/*********************************************************************************
  *函数名称:void area_flash_del_line( u32 del_id )
  *功能描述:删除线路
  *输	入:	del_id	:将要删除的线路ID，如果该值为0表示删除所有线路
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_flash_del_line( u32 del_id )
{
	u32				TempAddress;
	TypeDF_AreaHead TempAreaHead;
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	for( TempAddress = ADDR_DF_LINE_START; TempAddress < ADDR_DF_LINE_END; )
	{
		sst25_read( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
		if( ( strncmp( TempAreaHead.Head, AREA_HEAD, strlen( AREA_HEAD ) ) == 0 ) && ( TempAreaHead.State ) )
		{
			if( ( TempAreaHead.ID == del_id ) || ( 0 == del_id ) )
			{
				TempAreaHead.State = AREA_None;
				sst25_write_through( TempAddress, (u8*)&TempAreaHead, sizeof( TypeDF_AreaHead ) );
			}
		}
		TempAddress += DF_LINESaveSect;
	}
	area_flash_read_line( line_buffer, LINE_BUF_SIZE );
	rt_sem_release( &sem_dataflash );
}

/*********************************************************************************
  *函数名称:void area_jt808_commit_ack(u16 fram_num,u16 cmd_id,u8 isFalse)
  *功能描述:通用应答，单包OK应答
  *输	入:	fram_num:应答流水号
   cmd_id	:接收时的808命令
   statue   :表示状态，0:表示OK	1:表示失败	2:表示消息有误	3:表示不支持
  *输	出:	none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-24
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_jt808_commit_ack( u16 fram_num, u16 cmd_id, u8 statue )
{
	u8 pbuf[8];
	data_to_buf( pbuf, fram_num, 2 );
	data_to_buf( pbuf + 2, cmd_id, 2 );
	pbuf[4] = statue;
	jt808_tx_ack( 0x0001, pbuf, 5 );
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_del(uint8_t linkno,uint8_t *pmsg, ENUM_AREA  del_State))
  *功能描述:808删除圆形区域处理函数
  *输	入:	pmsg		:808消息体数据
   msg_len		:808消息体长度
   del_State	:表示要删除的类型
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_del( uint8_t linkno, uint8_t *pmsg, ENUM_AREA del_State )
{
	u16 i;
	u32 tempu32data;
	u16 cmd_id;
	u8	*msg;
	//u16 msg_len;
	u16 fram_num;

	cmd_id = buf_to_data( pmsg, 2 );
	//msg_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;
	msg			= pmsg;
	if( pmsg[0] == 0 )
	{
		if( AREA_Line == del_State )
		{
			area_flash_del_line( 0 );
		}else
		{
			area_flash_del_area( 0, del_State );
		}
	}else
	{
		msg++;
		for( i = 0; i < pmsg[0]; i++ )
		{
			tempu32data = buf_to_data( msg, 2 );
			if( AREA_Line == del_State )
			{
				area_flash_del_line( tempu32data );
			}else
			{
				area_flash_del_area( tempu32data, del_State );
			}
			msg += 4;
		}
	}
	jt808_tx_0x0001( fram_num, cmd_id, 0 );
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8600(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808设置圆形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8600( uint8_t linkno, uint8_t *pmsg )
{
	u16				i;
	u16				datalen;
	u16				tempu16data;
	u32				tempu32data;
	u32				Longi, Lati; ///经度和纬度
	TypeDF_AreaHead *pTempHead;
	u8				tempbuf[64];
	double			temp_d;

