icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
	u8				*msg;
	//u16 msg_len;
	u16				fram_num;

	//msg_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;
	msg			= pmsg;

	pTempHead = (TypeDF_AreaHead*)tempbuf;
	///808消息体部分
	msg += 2; ///设置属性 1byte,区域总数 1byte

	for( i = 0; i < pmsg[1]; i++ )
	{
		datalen		= 18;
		tempu16data = buf_to_data( msg + 4, 2 );
		if( tempu16data & BIT( 0 ) )
		{
			datalen += 12;
		}
		if( tempu16data & BIT( 1 ) )
		{
			datalen += 3;
		}
		memcpy( pTempHead->Head, AREA_HEAD, 4 );
		pTempHead->Len		= datalen + 23;
		pTempHead->State	= AREA_Circular;

		///计算该形状的外框矩形
		Lati	= buf_to_data( msg + 6, 4 );
		Longi	= buf_to_data( msg + 10, 4 );
		///计算圆半径对应的经度数值
		tempu32data = dis_to_Longi( Lati, buf_to_data( msg + 14, 4 ) );

		pTempHead->Rect_left.Longi	= Longi - tempu32data;
		pTempHead->Rect_right.Longi = Longi + tempu32data;
		///计算圆半径对应的纬度数值
		temp_d						= buf_to_data( msg + 14, 4 );
		tempu32data					= temp_d * 1000000 / WLENGH;
		pTempHead->Rect_left.Lati	= Lati + tempu32data;
		pTempHead->Rect_right.Lati	= Lati - tempu32data;
		///复制电子围栏数据到将要写入的结构体中
		memcpy( (void*)&pTempHead->ID, msg, datalen );
		area_flash_write_area( area_buffer, sizeof( area_buffer ), pTempHead );
	}
	jt808_tx_0x0001( fram_num, 0x8600, 0 );
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8601(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808删除圆形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8601( uint8_t linkno, uint8_t *pmsg )
{
	return area_jt808_del( linkno, pmsg, AREA_Circular );
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8602(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808设置矩形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8602( uint8_t linkno, uint8_t *pmsg )
{
	u16				i;
	u16				datalen;
	u16				tempu16data;
	TypeDF_AreaHead *pTempHead;
	u8				tempbuf[64];

	u8				*msg;
// u16 msg_len;
	u16				fram_num;

	//msg_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;
	msg			= pmsg;

	pTempHead = (TypeDF_AreaHead*)tempbuf;
	///808消息体部分
	msg += 2; ///设置属性 1byte,区域总数 1byte

	for( i = 0; i < pmsg[1]; i++ )
	{
		datalen		= 22;
		tempu16data = buf_to_data( msg + 4, 2 );
		if( tempu16data & BIT( 0 ) )
		{
			datalen += 12;
		}
		if( tempu16data & BIT( 1 ) )
		{
			datalen += 3;
		}
		memcpy( pTempHead->Head, AREA_HEAD, 4 );
		pTempHead->Len		= datalen + 23;
		pTempHead->State	= AREA_Rectangle;

		///计算该形状的外框矩形
		pTempHead->Rect_left.Longi	= buf_to_data( msg + 10, 4 );
		pTempHead->Rect_right.Longi = buf_to_data( msg + 18, 4 );
		pTempHead->Rect_left.Lati	= buf_to_data( msg + 6, 4 );
		pTempHead->Rect_right.Lati	= buf_to_data( msg + 14, 4 );

		///复制电子围栏数据到将要写入的结构体中
		memcpy( (void*)&pTempHead->ID, msg, datalen );
		area_flash_write_area( area_buffer, sizeof( area_buffer ), pTempHead );
	}
	jt808_tx_0x0001( fram_num, 0x8602, 0 );
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8603(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808删除矩形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8603( uint8_t linkno, uint8_t *pmsg )
{
	return area_jt808_del( linkno, pmsg, AREA_Rectangle );
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8604(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808设置多边形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8604( uint8_t linkno, uint8_t *pmsg )
{
	u16				i;
	u16				datalen;
	u16				tempu16data;
	u32				Longi, Lati; ///经度和纬度
	TypeDF_AreaHead *pTempHead = NULL;

	u8				*msg;
// u16 msg_len;
	u16				fram_num;

	//msg_len	= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );
	pmsg		+= 12;
	msg			= pmsg;

	///808消息体部分

	datalen		= 6;
	tempu16data = buf_to_data( msg + 4, 2 );
	if( tempu16data & BIT( 0 ) )
	{
		datalen += 12;
	}
	if( tempu16data & BIT( 1 ) )
	{
		datalen += 3;
	}
	///顶点数量
	tempu16data = buf_to_data( msg + datalen, 2 );
	if( tempu16data > 64 ) ///限定最大顶点数为64
	{
		tempu16data = 64;
	}
	datalen += 2;

	pTempHead = (TypeDF_AreaHead*)rt_malloc( datalen + tempu16data * 8 );
	if( pTempHead )
	{
		///计算该形状的外框矩形
		for( i = 0; i < tempu16data; i++ )
		{
			Lati	= buf_to_data( msg + datalen + i * 8, 4 );
			Longi	= buf_to_data( msg + datalen + i * 8 + 4, 4 );
			if( i == 0 )
			{
				pTempHead->Rect_left.Lati	= Lati;
				pTempHead->Rect_right.Lati	= Lati;
				pTempHead->Rect_left.Longi	= Longi;
				pTempHead->Rect_right.Longi = Longi;
			}else
			{
				if( pTempHead->Rect_left.Lati < Lati )
				{
					pTempHead->Rect_left.Lati = Lati;
				}
				if( pTempHead->Rect_right.Lati > Lati )
				{
					pTempHead->Rect_right.Lati = Lati;
				}

				if( pTempHead->Rect_left.Longi > Longi )
				{
					pTempHead->Rect_left.Longi = Longi;
				}
				if( pTempHead->Rect_right.Longi < Longi )
				{
					pTempHead->Rect_right.Longi = Longi;
				}
			}
		}
		datalen += tempu16data * 8;

		memcpy( pTempHead->Head, AREA_HEAD, 4 );
		pTempHead->Len		= datalen + 23;
		pTempHead->State	= AREA_Polygon;

