icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
		///复制电子围栏数据到将要写入的结构体中
		memcpy( (void*)&pTempHead->ID, msg, datalen );
		area_flash_write_area( area_buffer, sizeof( area_buffer ), pTempHead );
		jt808_tx_0x0001( fram_num, 0x8604, 0 );
		rt_free( pTempHead );
	}else
	{
		jt808_tx_0x0001( fram_num, 0x8604, 3 );
	}
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8605(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808删除多边形区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8605( uint8_t linkno, uint8_t *pmsg )
{
	return area_jt808_del( linkno, pmsg, AREA_Polygon );
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8606(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808设置线路处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8606( uint8_t linkno, uint8_t *pmsg )
{
	u16				i;
	u16				datalen;
	u16				tempu16data;
	u16				attr;
	u32				Longi, Lati; ///经度和纬度
	TypeDF_AreaHead *pTempHead = NULL;

	u8				*msg;
	u16				msg_len;
	u16				fram_num;

	msg_len		= buf_to_data( pmsg + 2, 2 ) & 0x3FF;
	fram_num	= buf_to_data( pmsg + 10, 2 );

	///处理多包的情况，暂时不支持多包
	if( ( pmsg[2] & 0x20 ) == 0 )
	{
		tempu16data = buf_to_data( pmsg + 14, 2 );
		if( tempu16data )
		{
			jt808_tx_0x0001( fram_num, 0x8606, 3 );
			return RT_ERROR;
		}
		pmsg += 16;
	}else
	{
		pmsg += 12;
	}
	msg = pmsg;

	///808消息体部分
	datalen		+= 6;
	tempu16data = buf_to_data( msg + 4, 2 );
	if( tempu16data & BIT( 0 ) )
	{
		datalen += 12;
	}
	///顶点数量
	tempu16data = buf_to_data( msg + datalen, 2 );
	if( tempu16data > 32 ) ///限定最大顶点数为32
	{
		tempu16data = 32;
	}
	datalen += 2;

	//只取一包的线路信号，暂时不支持分包功能
	if( tempu16data > ( msg_len - datalen ) / 25 )
	{
		tempu16data = ( msg_len - datalen ) / 25;
	}

	pTempHead = (TypeDF_AreaHead*)rt_malloc( 800 );
	if( pTempHead )
	{
		///计算该形状的外框矩形
		for( i = 0; i < tempu16data; i++ )
		{
			//Lati	= buf_to_data( msg + datalen + i * 25 + 8, 4 );
			//Longi	= buf_to_data( msg + datalen + i * 25 + 12, 4 );
			Lati	= buf_to_data( msg + datalen + 8, 4 );
			Longi	= buf_to_data( msg + datalen + 12, 4 );
			attr	= buf_to_data( msg + datalen + 17, 1 );
			if( i == 0 )
			{
				pTempHead->Rect_left.Lati	= Lati;
				pTempHead->Rect_right.Lati	= Lati;
				pTempHead->Rect_left.Longi	= Longi;
				pTempHead->Rect_right.Longi = Longi;
			}else
			{
				if( pTempHead->Rect_left.Lati < Lati )
				{
					pTempHead->Rect_left.Lati = Lati;
				}
				if( pTempHead->Rect_right.Lati > Lati )
				{
					pTempHead->Rect_right.Lati = Lati;
				}

				if( pTempHead->Rect_left.Longi > Longi )
				{
					pTempHead->Rect_left.Longi = Longi;
				}
				if( pTempHead->Rect_right.Longi < Longi )
				{
					pTempHead->Rect_right.Longi = Longi;
				}
			}
			if( attr & BIT( 0 ) )
				{
				datalen += 4;
				}
			if( attr & BIT( 1 ) )
				{
				datalen += 3;
				}
			datalen += 18;
			if( datalen > (800 - 48 ))			///必须要减掉该值，防止溢出 23(pTempHead)+25(分段线路) = 48 ;
				break;
		}

		memcpy( pTempHead->Head, AREA_HEAD, 4 );
		pTempHead->Len		= datalen + 23;
		pTempHead->State	= AREA_Line;

		///复制电子围栏数据到将要写入的结构体中
		memcpy( (void*)&pTempHead->ID, msg, datalen );
		area_flash_write_line( line_buffer, sizeof( line_buffer ), pTempHead );
		jt808_tx_0x0001( fram_num, 0x8606, 0 );
		rt_free( pTempHead );
	}else
	{
		jt808_tx_0x0001( fram_num, 0x8604, 3 );
	}
	return RT_EOK;
}

/*********************************************************************************
  *函数名称:rt_err_t area_jt808_0x8607(uint8_t linkno,uint8_t *pmsg)
  *功能描述:808删除线路区域处理函数
  *输	入:	pmsg	:808消息体数据
   msg_len	:808消息体长度
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
rt_err_t area_jt808_0x8607( uint8_t linkno, uint8_t *pmsg )
{
	return area_jt808_del( linkno, pmsg, AREA_Line );
}

/*********************************************************************************
  *函数名称:void area_set_alarm(Type_AREA_ALARM *area_alarm)
  *功能描述:产生了一个新的报警，通过该函数添加到数组中
  *输	入:	area_alarm	:新产生的电子围栏相关报警
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_set_alarm(Type_AREA_ALARM *area_alarm)
{
 u8 i;
 u8 empty_num=0xFF;
 char tempbuf[64];
 
 for(i=0;i<AREA_ALARM_NUM;i++)
 	{
 	///彻底清空路段行驶过长的报警,如果当前路段的ID和历史路段ID不相同,并且该历史路段已经清除了报警，则将历史路段清空
	if((area_alarm_array[i].attri_id == 22)&&(area_alarm->attri_id == 22)&&((area_alarm_array[i].alarm_bit & 0x80) == 0))
 		{
 		if(memcmp(area_alarm->data,area_alarm_array[i].data,4))
 			{
 			memset(&area_alarm_array[i],0,sizeof(Type_AREA_ALARM));
 			}
 		}
	///清空不符合规范的数据
	if(area_alarm_array[i].len > 7)
		{
		memset(&area_alarm_array[i],0,sizeof(Type_AREA_ALARM));
		}
 	///找到第一个空的区域
 	if(area_alarm_array[i].attri_id == 0)
 		{
 		empty_num = i;
 		}
 	if(memcmp(&(area_alarm->attri_id),&(area_alarm_array[i].attri_id),sizeof(Type_AREA_ALARM)-1) == 0)
		{
		return;
 		}
 	}
 area_alarm->alarm_bit |= BIT(7);		//表示新的没有删除的消息
 if(empty_num<AREA_ALARM_NUM)
 	{
 	memcpy(&area_alarm_array[empty_num],area_alarm,sizeof(Type_AREA_ALARM));
 	}
 else
 	{
 	sprintf(tempbuf,"%s","电子围栏报警溢出:");
 	Hex_To_Ascii(tempbuf+strlen(tempbuf), (u8 *)area_alarm, sizeof(Type_AREA_ALARM));
	sd_write_console(tempbuf);
 	}
}


/*********************************************************************************
  *函数名称:void area_clear_alarm(Type_AREA_ALARM *area_alarm)
  *功能描述:清空指定标记位的报警
  *输	入:	area_alarm	:新产生的电子围栏相关报警
  *输	出:none
  *返 回 值:rt_err_t
  *作	者:白养民
  *创建日期:2013-06-16
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_clear_alarm( uint32_t clear_bits )
{
 u8 i;
 u8 empty_num=0xFF;
 
