icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
 for(i=0;i<AREA_ALARM_NUM;i++)
 	{
 	if(BIT(area_alarm_array[i].alarm_bit & 0x1F) & clear_bits)
 		{
 		///如果是路段则并不删除，只是清空标记表示报警已经处理过，防止重复报警
 		if( area_alarm_array[i].alarm_bit == 22)
 			{
			area_alarm_array[i].alarm_bit &= 0x1F;
 			}
		else
			{
			memset(&area_alarm_array[i],0,sizeof(Type_AREA_ALARM));
			}
 		}
 	}
}


/*********************************************************************************
  *函数名称:void area_alarm_enter( Type_AreaInfo *AreaInfo )
  *功能描述:电子围栏进入报警
  *输	入:	AreaInfo	:当前电子围栏信息
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_enter( Type_AreaInfo *AreaInfo )
{
	Type_AREA_ALARM area_alarm;
	memset( &area_alarm, 0, sizeof( Type_AREA_ALARM ) );
	area_alarm.alarm_bit	= 20;
	area_alarm.attri_id		= 0x12;
	area_alarm.len			= 6;
	area_alarm.data[0]		= AreaInfo->area_data->State;
	data_to_buf( area_alarm.data + 1, AreaInfo->area_data->ID, 4 );
	area_alarm.data[5] = 0;
	area_set_alarm(&area_alarm);
	//rt_mq_send( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ) );
	rt_kprintf( "\n 进入电子围栏:ID = %d", AreaInfo->area_data->ID );
}

/*********************************************************************************
  *函数名称:void area_alarm_leave( Type_AreaInfo *AreaInfo )
  *功能描述:电子围栏离开报警
  *输	入:	AreaInfo	:当前电子围栏信息
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_leave( Type_AreaInfo *AreaInfo )
{
	Type_AREA_ALARM area_alarm;
	memset( &area_alarm, 0, sizeof( Type_AREA_ALARM ) );
	area_alarm.alarm_bit	= 20;
	area_alarm.attri_id		= 0x12;
	area_alarm.len			= 6;
	area_alarm.data[0]		= AreaInfo->area_data->State;
	data_to_buf( area_alarm.data + 1, AreaInfo->area_data->ID, 4 );
	area_alarm.data[5] = 1;
	area_set_alarm(&area_alarm);
	//rt_mq_send( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ) );
	rt_kprintf( "\n 离开电子围栏:ID = %d", AreaInfo->area_data->ID );
}

/*********************************************************************************
  *函数名称:void area_alarm_speed( Type_AreaInfo *AreaInfo )
  *功能描述:电子围栏超速报警
  *输	入:	AreaInfo	:当前电子围栏信息
  *输	出: none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_speed( Type_AreaInfo *AreaInfo )
{
	AreaInfo->speed = 1;
	rt_kprintf( "\n 超速报警:ID = %d", AreaInfo->area_data->ID );
}

/*********************************************************************************
  *函数名称:void area_alarm_enter_line( Type_LineInfo *AreaInfo )
  *功能描述:路线进入报警
  *输	入:	AreaInfo	:当前线路信息
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_enter_line( Type_LineInfo *AreaInfo )
{
	Type_AREA_ALARM area_alarm;
	jt808_param_bk.car_alarm &= ~BIT_ALARM_DEVIATE;
	memset( &area_alarm, 0, sizeof( Type_AREA_ALARM ) );
	area_alarm.alarm_bit	= 21;
	area_alarm.attri_id		= 0x12;
	area_alarm.len			= 6;
	area_alarm.data[0]		= AreaInfo->line_head.State;
	data_to_buf( area_alarm.data + 1, AreaInfo->line_head.ID, 4 );
	area_alarm.data[5] = 0;
	area_set_alarm(&area_alarm);
	//rt_mq_send( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ) );
	rt_kprintf( "\n 进入线路:ID = %d", AreaInfo->line_head.ID );
}

/*********************************************************************************
  *函数名称:void area_alarm_leave_line( Type_LineInfo *AreaInfo )
  *功能描述:线路离开报警
  *输	入:	AreaInfo	:当前线路信息
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_leave_line( Type_LineInfo *AreaInfo )
{
	Type_AREA_ALARM area_alarm;
	memset( &area_alarm, 0, sizeof( Type_AREA_ALARM ) );
	area_alarm.alarm_bit	= 21;
	area_alarm.attri_id		= 0x12;
	area_alarm.len			= 6;
	area_alarm.data[0]		= AreaInfo->line_head.State;
	data_to_buf( area_alarm.data + 1, AreaInfo->line_head.ID, 4 );
	area_alarm.data[5] = 1;
	area_set_alarm(&area_alarm);
	//rt_mq_send( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ) );
	rt_kprintf( "\n 离开线路:ID = %d", AreaInfo->line_head.ID );
}

/*********************************************************************************
  *函数名称:void area_alarm_speed_road( Type_LineInfo *AreaInfo ,u32 road_id)
  *功能描述:电子围栏超速报警
  *输	入:	AreaInfo	:当前线路信息
   road_id		:路段ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_road_speed( Type_LineInfo *AreaInfo, u32 road_id )
{
	AreaInfo->speed = 1;
}

/*********************************************************************************
  *函数名称:void area_alarm_road_deviate( Type_LineInfo *AreaInfo,u32 road_id )
  *功能描述:线路路段偏离报警
  *输	入:	AreaInfo	:当前线路信息
   road_id		:路段ID
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-03
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_road_deviate( Type_LineInfo *AreaInfo, u32 road_id )
{
	jt808_param_bk.car_alarm |= BIT_ALARM_DEVIATE;
}

/*********************************************************************************
  *函数名称:void area_alarm_road_timer( u16 road_time,u32 road_id, u8 state)
  *功能描述:线路路段行驶时间过长/不足报警
  *输	入:	road_time	:当前路段行驶时长
   			road_id		:路段ID
  			state		:行驶时间过长或不足报警，0表示时间不足，1表示时间太长
  *输	出:none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-03
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_alarm_road_timer( u16 road_time, u32 road_id, u8 state )
{
	Type_AREA_ALARM area_alarm;
	memset( &area_alarm, 0, sizeof( Type_AREA_ALARM ) );
	area_alarm.alarm_bit	= 22;
	area_alarm.attri_id		= 0x13;
	area_alarm.len			= 6;
	data_to_buf( area_alarm.data, road_id, 4 );
	data_to_buf( area_alarm.data + 4, road_time, 2 );
	area_alarm.data[6] = state;
	area_set_alarm(&area_alarm);
	//rt_mq_send( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ) );
}



/*********************************************************************************
  *函数名称:u8 area_process_circular(TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
  *功能描述:判断当前位置是否在该圆形区域里面
  *输	入:	pCoo	:当前位置坐标
   AreaInfo:当前圆形区域
  *输	出:none
  *返 回 值:u8	1:表示在该区域，	0:表示不在该区域
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 area_process_circular( TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
{
	u16 datalen;
	u16 attri;                      ///区域属性
	u32 lati, longi;                ///区域中心点坐标
	u32 r;                          ///半径
	u32 d;                          ///距离
	u32 curspeed;                   ///当前速度
	u32 speed		= 0xFFFFFFFF;   ///最高速度
	u32 speedtime	= 0xFFFFFFFF;   ///超速时间
	rt_kprintf( "\n 圆形区域判断" );
	if( Check_CooisInRect( pCoo, AreaInfo->area_data ) == 0 )
	{
		rt_kprintf( "\n 没在矩形里面" );
		goto AREA_OUT;
	}
	attri	= buf_to_data( AreaInfo->area_data->Data, 2 );
	datalen = 14;
	if( attri & BIT( 0 ) ) ///根据时间
	{
		if( Check_Area_Time( &AreaInfo->area_data->Data[datalen], &AreaInfo->area_data->Data[6 + datalen] ) == 0 )
		{
			rt_kprintf( "\n 没在时间范围" );
			goto AREA_OUT;
		}
		datalen += 12;
	}
	if( attri & BIT( 1 ) ) ///限速
	{
		speed		= buf_to_data( AreaInfo->area_data->Data + datalen, 2 );
		speedtime	= buf_to_data( AreaInfo->area_data->Data + datalen + 2, 1 );
		datalen		+= 3;
	}
	lati	= buf_to_data( AreaInfo->area_data->Data + 2, 4 );
	longi	= buf_to_data( AreaInfo->area_data->Data + 6, 4 );
	r		= buf_to_data( AreaInfo->area_data->Data + 10, 4 );
	d		= dis_Point2Point( lati, longi, pCoo->Lati, pCoo->Longi );  ///当前点到中心点的距离
	//rt_kprintf("\r\n circular_dis= %d,   r=%d",d,r);
	if( d <= r )
	{
		goto AREA_IN;                                                   ///进区域
	}else
	{
		goto AREA_OUT;                                                  ///出区域
	}

AREA_IN:                                                                ///进区域
	//curspeed	= gps_speed;
	curspeed = test_speed;
	if( AreaInfo->in_area == 0 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 1;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_enter( AreaInfo );
	}
	if( attri & BIT( 1 ) ) ///限速
	{
		if( curspeed < speed )
		{
			AreaInfo->speed_utc = utc_now;
		}
		if( utc_now - AreaInfo->speed_utc > speedtime )
		{
			area_alarm_speed( AreaInfo );
		}else
		{
			AreaInfo->speed = 0;
		}
	}
	return 1;
AREA_OUT:     ///出区域
	if( AreaInfo->in_area == 1 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 0;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_leave( AreaInfo );
	}
	return 0;
}

/*********************************************************************************
  *函数名称:u8 area_process_rectangle(TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
  *功能描述:判断当前位置是否在该矩形区域里面
  *输	入:	pCoo	:当前位置坐标
   AreaInfo:当前矩形区域
  *输	出:none
  *返 回 值:u8	1:表示在该区域，	0:表示不在该区域
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 area_process_rectangle( TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
{
	u16 datalen;
	u16 attri;                      ///区域属性
	u32 curspeed;                   ///当前速度
	u32 speed		= 0xFFFFFFFF;   ///最高速度
	u32 speedtime	= 0xFFFFFFFF;   ///超速时间
	if( Check_CooisInRect( pCoo, AreaInfo->area_data ) == 0 )
	{
		goto AREA_OUT;
	}
	attri	= buf_to_data( AreaInfo->area_data->Data, 2 );
	datalen = 18;
	if( attri & BIT( 0 ) )          ///根据时间
	{
		if( Check_Area_Time( &AreaInfo->area_data->Data[datalen], &AreaInfo->area_data->Data[6 + datalen] ) == 0 )
		{
			goto AREA_OUT;
		}
		datalen += 12;
	}

	if( attri & BIT( 1 ) ) ///限速
	{
		speed		= buf_to_data( AreaInfo->area_data->Data + datalen, 2 );
		speedtime	= buf_to_data( AreaInfo->area_data->Data + datalen + 2, 1 );
		datalen		+= 3;
	}

