icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
	//AREA_IN:				///进区域
	//curspeed	= gps_speed;
	curspeed = test_speed;
	if( AreaInfo->in_area == 0 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 1;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_enter( AreaInfo );
	}
	if( attri & BIT( 1 ) ) ///限速
	{
		if( curspeed < speed )
		{
			AreaInfo->speed_utc = utc_now;
		}
		if( utc_now - AreaInfo->speed_utc > speedtime )
		{
			area_alarm_speed( AreaInfo );
		}else
		{
			AreaInfo->speed = 0;
		}
	}
	return 1;
AREA_OUT:     ///出区域
	if( AreaInfo->in_area == 1 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 0;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_leave( AreaInfo );
	}
	return 0;
}

/*********************************************************************************
  *函数名称:u8 area_process_polygon(TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
  *功能描述:判断当前位置是否在该多边形区域里面
  *输	入:	pCoo	:当前位置坐标
   AreaInfo:当前多边形区域
  *输	出:none
  *返 回 值:u8	1:表示在该区域，	0:表示不在该区域
  *作	者:白养民
  *创建日期:2013-07-01
  *数学原形:	1、在区域内部的所有的点都会满足一个条件，该点到所有顶点的角度是可以覆盖360度区域所有角度
   2、计算时可以根据该点和所有连续的两点之间的角度小于180度的方法进行遍历，找出最大角度和最小角度
   当所有的点都遍历之后发现区域不是闭合的则表示该点不在多边形区域里面。
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 area_process_polygon( TypeStruct_Coor *pCoo, Type_AreaInfo *AreaInfo )
{
	u16 i;
	u16 point_num;
	u16 datalen;
	u16 attri;                                                              ///区域属性
	u32 lati, longi;                                                        ///区域中心点坐标
	u32 curspeed;                                                           ///当前速度
	u32 speed		= 0xFFFFFFFF;                                           ///最高速度
	u32 speedtime	= 0xFFFFFFFF;                                           ///超速时间
	u16 angle_first = 0, angle_last = 0, angle_start = 0, angle_end = 0;    ///第一次的角度，最后一次的角度，开始角度，接收角度，
	//u16 angle_total=0;	///总角度
	u16 angle_1, angle_2, angle;                                            ///计算当前点和多边形多点之间的角度
	u16 area_state = 0;                                                     ///该值为0x03表示在区域里面
	if( Check_CooisInRect( pCoo, AreaInfo->area_data ) == 0 )
	{
		goto AREA_OUT;
	}
	attri	= buf_to_data( AreaInfo->area_data->Data, 2 );
	datalen = 2;
	if( attri & BIT( 0 ) )                                                  ///根据时间
	{
		if( Check_Area_Time( &AreaInfo->area_data->Data[datalen], &AreaInfo->area_data->Data[6 + datalen] ) == 0 )
		{
			goto AREA_OUT;
		}
		datalen += 12;
	}
	if( attri & BIT( 1 ) ) ///限速
	{
		speed		= buf_to_data( AreaInfo->area_data->Data + datalen, 2 );
		speedtime	= buf_to_data( AreaInfo->area_data->Data + datalen + 2, 1 );
		datalen		+= 3;
	}

	point_num	= buf_to_data( AreaInfo->area_data->Data + datalen, 2 );
	datalen		+= 2;
	///遍历一遍所有的点，计算出当前坐标是不是在该区域中
	for( i = 0; i <= point_num; i++ ) ///多遍历一次，计算最后的点和第一个点之间的区域角度
	{
		area_state = 0;
		if( i < point_num )
		{
			lati	= buf_to_data( AreaInfo->area_data->Data + 2, 4 );
			longi	= buf_to_data( AreaInfo->area_data->Data + 6, 4 );
			datalen += 8;
			angle	= AnglPoint2Point( pCoo->Lati, pCoo->Longi, lati, longi );
		}else
		{
			angle = angle_first;
		}
		if( i == 0 ) ///如果是第一个点，则将该点的值设置为当前值
		{
			angle_start = angle;
			angle_end	= angle;
			angle_first = angle;
			angle_last	= angle;
		}else
		{
			///查找对比当前角度和上次角度的大小，从而得出哪个点是旋转角度的开始点，哪个点是结束点
			///对比之前的点和当前的点，得出当前扫描的角度范围
			if( ( angle > angle_last ) && ( angle - angle_last <= 180 ) )
			{
				angle_1 = angle_last;
				angle_2 = angle;
			}else if( ( angle > angle_last ) && ( angle - angle_last > 180 ) )
			{
				angle_1 = angle;
				angle_2 = angle_last;
			}else if( ( angle <= angle_last ) && ( angle_last - angle <= 180 ) )
			{
				angle_1 = angle;
				angle_2 = angle_last;
			}else ///if((angle <= angle_last)&&( angle_last - angle > 180))
			{
				angle_1 = angle_last;
				angle_2 = angle;
			}
			///将当前扫描的角度范围放入总的角度范围中
			if( Check_Angle( angle_start, angle_1, angle_2 ) )
			{
				area_state	|= BIT( 0 );
				angle_start = angle_1;
			}
			if( Check_Angle( angle_end, angle_1, angle_2 ) )
			{
				area_state	|= BIT( 1 );
				angle_end	= angle_2;
			}
			angle_last = angle;
			if( area_state == 0x03 )    ///检查到了当前点在多边形区域中
			{
				break;
			}
		}
	}
	if( area_state == 0x03 )            ///检查到了当前点在多边形区域中
	{
		goto AREA_IN;
	}else
	{
		goto AREA_OUT;
	}
AREA_IN:                                ///进区域
	curspeed = gps_speed;
	if( AreaInfo->in_area == 0 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 1;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_enter( AreaInfo );
	}
	if( attri & BIT( 1 ) ) ///限速
	{
		if( curspeed < speed )
		{
			AreaInfo->speed_utc = utc_now;
		}
		if( utc_now - AreaInfo->speed_utc > speedtime )
		{
			area_alarm_speed( AreaInfo );
		}else
		{
			AreaInfo->speed = 0;
		}
	}
	return 1;
AREA_OUT:     ///出区域
	if( AreaInfo->in_area == 1 )
	{
		AreaInfo->speed			= 0;
		AreaInfo->in_area		= 0;
		AreaInfo->in_area_utc	= utc_now;
		AreaInfo->speed_utc		= utc_now;
		area_alarm_leave( AreaInfo );
	}
	return 0;
}

/*********************************************************************************
  *函数名称:u8 area_process_line(TypeStruct_Coor *pCoo, Type_LineInfo *AreaInfo )
  *功能描述:判断当前位置是否在该线路上并且计算和线路相关报警及其他操作
  *输	入:	pCoo	:当前位置坐标
   AreaInfo:当前线路
  *输	出:none
  *返 回 值:u8	1:表示在该区域，	0:表示不在该区域
  *作	者:白养民
  *创建日期:2013-07-02
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u8 area_process_line( TypeStruct_Coor *pCoo, Type_LineInfo *AreaInfo )
{
	u16 i;
	u16 point_num;
	u16 datalen;
	u16 attri;                          ///线路属性
	u8	road_attri;                     ///路段属性
	u32 road_id;                        ///路段ID
	u16 road_width;                     ///路段宽度
	u32 road_timer_max	= 0xFFFFFFFF;   ///路段行驶过长阈值
	u32 road_timer_min	= 0;            ///路段行驶不足阈值
	u32 road_dis;                       ///当前位置坐标和路段的距离
	u32 road_dis_min	= 0xFFFFFFFF;   ///计算的所有路段中，当前点距离最近的距离
	u32 road_dis_min_id = 0;            ///计算的所有路段中，当前点距离最近的路段ID
	//u32 road_dis_min_width=0;			///计算的所有路段中，当前点距离最近的路段的宽度
	u32 lati, longi;                    ///坐标
	u32 lati_last = 0, longi_last = 0;  ///上次处理的拐点坐标
	u32 curspeed;                       ///当前速度
	u32 speed		= 0xFFFFFFFF;       ///最高速度
	u32 speedtime	= 0xFFFFFFFF;       ///超速时间

	if( Check_CooisInRect( pCoo, &AreaInfo->line_head ) == 0 )
	{
		goto AREA_OUT;
	}
	///检查当前处理线路数据是不是在RAM 的 buf中，为RT_NULL表示不在，需要从flash中获取数据
	if( AreaInfo->line_data == RT_NULL )
	{
		///从flash中获取当前处理的线路数据
		if( area_flash_get_line_data( line_buffer, sizeof( line_buffer ), AreaInfo ) == 0 )
		{
			goto AREA_OUT;
		}
	}
	attri	= buf_to_data( AreaInfo->line_data + 4, 2 );
	datalen = 6;
	if( attri & BIT( 0 ) ) ///根据时间
	{
		if( Check_Area_Time( &AreaInfo->line_data[datalen], &AreaInfo->line_data[6 + datalen] ) == 0 )
		{
			goto AREA_OUT;
		}
		datalen += 12;
	}

