icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
	point_num	= buf_to_data( AreaInfo->line_data + datalen, 2 );
	datalen		+= 2;
	///遍历一遍所有的点，计算出当前坐标是不是在该线路
	for( i = 0; i < point_num; i++ )
	{
		road_timer_max	= 0xFFFFFFFF;   ///路段行驶过长阈值
		road_timer_min	= 0x00000000;   ///路段行驶不足阈值
		speed			= 0xFFFFFFFF;   ///最高速度
		speedtime		= 0xFFFFFFFF;   ///超速时间
		///拐点 ID 4BYTE
		datalen += 4;
		///路段 ID 4BYTE
		road_id = buf_to_data( AreaInfo->line_data + datalen, 4 );
		datalen += 4;
		///拐点纬度  4BYTE
		lati	= buf_to_data( AreaInfo->line_data + datalen, 4 );
		datalen += 4;
		///拐点经度 4BYTE
		longi	= buf_to_data( AreaInfo->line_data + datalen, 4 );
		datalen += 4;
		///路段宽度 1BYTE
		road_width = AreaInfo->line_data[datalen++];
		///路段属性 1BYTE
		road_attri = AreaInfo->line_data[datalen++];
		if( road_attri & BIT( 0 ) )
		{
			///路段行驶过长阈值 2BYTE
			road_timer_max	= buf_to_data( AreaInfo->line_data + datalen, 2 );
			datalen			+= 2;
			///路段行驶不足阈值 2BYTE
			road_timer_min	= buf_to_data( AreaInfo->line_data + datalen, 2 );
			datalen			+= 2;
		}
		if( road_attri & BIT( 1 ) )
		{
			///路段最高速度 2BYTE
			speed	= buf_to_data( AreaInfo->line_data + datalen, 2 );
			datalen += 2;
			///路段超速持续时间 1BYTE
			speedtime	= buf_to_data( AreaInfo->line_data + datalen, 2 );
			datalen		+= 2;
		}
		if( i )                                 ///第一个拐点没有线路，第二个拐点以后才有线路。
		{
			road_dis = dis_Point2Line( pCoo->Lati, pCoo->Longi, lati_last, longi_last, lati, longi );
			if( road_dis <= road_width/2 )        ///在该路段
			{
				road_dis_min	= 0;
				road_dis_min_id = road_id;
				goto AREA_IN;
			}else if( road_dis != 0xFFFFFFFF )  ///不在线路宽度范围内
			{
				road_dis -= road_width;
				if( road_dis < road_dis_min )
				{
					road_dis_min	= road_dis;
					road_dis_min_id = road_id;
				}
			}else ///不在线路范围，什么都不做
			{
			}
		}
		lati_last	= lati;
		longi_last	= longi;
	}
	if( road_dis_min <= 300 ) ///路线偏离(当前点距离最近的线路如果小于300米，但是大于线路宽度，认为偏离线路)
	{
		area_alarm_road_deviate( AreaInfo, road_dis_min_id );
	}
	else
	{
		jt808_param_bk.car_alarm &= ~BIT_ALARM_DEVIATE;
	}
	goto AREA_OUT;

AREA_IN:     ///进区域
	curspeed = gps_speed;
	if( AreaInfo->in_area == 0 )
	{
		AreaInfo->speed				= 0;
		AreaInfo->in_area			= 1;
		AreaInfo->in_area_utc		= utc_now;
		AreaInfo->road_id			= road_id;
		AreaInfo->road_in_utc		= utc_now;
		AreaInfo->road_speed_utc	= utc_now;
		AreaInfo->road_timer_min	= road_timer_min;
		AreaInfo->road_timer_max	= road_timer_max;
		area_alarm_enter_line( AreaInfo );
	}
	if( road_id != AreaInfo->road_id )                                         	///行驶路段发生改变
	{
		if( utc_now - AreaInfo->road_in_utc < AreaInfo->road_timer_min )        ///路段行驶不足
		{
			area_alarm_road_timer( ( utc_now - AreaInfo->road_in_utc ), AreaInfo->road_id, 0 );
		}else if( utc_now - AreaInfo->road_in_utc > AreaInfo->road_timer_max )  ///路段行驶过长
		{
			area_alarm_road_timer( ( utc_now - AreaInfo->road_in_utc ), AreaInfo->road_id, 1 );
			//area_alarm_road_timer_clear();
		}
		AreaInfo->road_timer_min	= road_timer_min;
		AreaInfo->road_timer_max	= road_timer_max;
		AreaInfo->road_id			= road_id;
		AreaInfo->road_in_utc		= utc_now;
		AreaInfo->road_speed_utc	= utc_now;
	}
	if( road_attri & BIT( 0 ) ) ///路段行驶时间
	{
	}
	if( road_attri & BIT( 1 ) ) ///路段限速
	{
		if( curspeed < speed )
		{
			AreaInfo->road_speed_utc = utc_now;
		}
		if( utc_now - AreaInfo->road_speed_utc > speedtime )
		{
			area_alarm_road_speed( AreaInfo, road_id );
		}else
		{
			AreaInfo->speed = 0;
		}
	}
	return 1;
AREA_OUT:                                                                               ///出区域
	if( AreaInfo->in_area == 1 )
	{
		if( utc_now - AreaInfo->road_in_utc < AreaInfo->road_timer_min )        ///路段行驶不足
		{
			area_alarm_road_timer( ( utc_now - AreaInfo->road_in_utc ), AreaInfo->road_id, 0 );
		}else if( utc_now - AreaInfo->road_in_utc > AreaInfo->road_timer_max )  ///路段行驶过长
		{
			area_alarm_road_timer( ( utc_now - AreaInfo->road_in_utc ), AreaInfo->road_id, 1 );
		}
		AreaInfo->speed				= 0;
		AreaInfo->in_area			= 0;
		AreaInfo->in_area_utc		= utc_now;
		AreaInfo->road_id			= 0;
		AreaInfo->road_in_utc		= utc_now;
		AreaInfo->road_speed_utc	= utc_now;
		area_alarm_leave_line( AreaInfo );
	}
	return 0;
}

/*********************************************************************************
  *函数名称:void area_init(void)
  *功能描述:电子围栏参数初始化，该函数在终端初始化时调用
  			注意:该函数只能用来初始化存储区域，不可增加只能初始化一次的代码，不如不能初始化信号量
  			不能初始化线程等
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_init( void )
{
	///初始化消息队列
	//rt_mq_init( &mq_area, "mq_area_alarm", &msgpool_area[0], sizeof( Type_AREA_ALARM ) + sizeof( void* ), sizeof( msgpool_area ), RT_IPC_FLAG_FIFO );
	//rt_kprintf("enmu len=%d,area_info len=%d \r\n",sizeof(ENUM_AREA),sizeof(area_info));
	
	memset( (void*)area_alarm_array, 0, sizeof( area_alarm_array ) );
	memset( (void*)&Area_Para, 0, sizeof( Area_Para ) );
	rt_sem_take( &sem_dataflash, RT_TICK_PER_SECOND * FLASH_SEM_DELAY );
	area_flash_read_area( area_buffer, AREA_BUF_SIZE );
	area_flash_read_line( line_buffer, LINE_BUF_SIZE );
	rt_sem_release( &sem_dataflash );
}

/***********************************************************
* Function:
* Description:
* Input:
* Input:
* Output:
* Return:
* Others:
***********************************************************/
void area_read( void )
{
	u16 i;
	area_init( );
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		rt_kprintf( "\n 电子围栏 ID=%5d, 类型=%d", Area_Para.area_info[i].area_data->ID, Area_Para.area_info[i].area_data->State );
		rt_kprintf( "矩形区域为:经度1=%9d,纬度1=%9d,经度2=%9d,纬度2=%9d", \
		            Area_Para.area_info[i].area_data->Rect_left.Longi, \
		            Area_Para.area_info[i].area_data->Rect_left.Lati, \
		            Area_Para.area_info[i].area_data->Rect_right.Longi, \
		            Area_Para.area_info[i].area_data->Rect_right.Lati );
		//rt_kprintf( "\n   DATA=" );
		//printer_data_hex( (u8*)Area_Para.area_info[i].area_data, Area_Para.area_info[i].area_data->Len );
	}
	///线路处理，如果当前位置在一个线路中，则跳出线路扫描
	for( i = 0; i < Area_Para.line_num; i++ )
	{
		rt_kprintf( "\n 线    路 ID=%5d, 类型=%d", Area_Para.line_info[i].line_head.ID, Area_Para.line_info[i].line_head.State );
		rt_kprintf( "矩形区域为:经度1=%9d,纬度1=%9d,经度2=%9d,纬度2=%9d", \
		            Area_Para.area_info[i].area_data->Rect_left.Longi, \
		            Area_Para.area_info[i].area_data->Rect_left.Lati, \
		            Area_Para.area_info[i].area_data->Rect_right.Longi, \
		            Area_Para.area_info[i].area_data->Rect_right.Lati );
	}
}

FINSH_FUNCTION_EXPORT( area_read, area_read );


/*********************************************************************************
  *函数名称:void area_process(void)
  *功能描述:电子围栏和线路报警处理函数，该函数调用前需要首先调用一次函数"area_init",否则会异常。
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_process( void )
{
	u16				i;
	TypeStruct_Coor cur_Coo;
	static u16		cur_line = 0;
	//static u16 cur_area = 0;

	///获取当前位置
	cur_Coo.Lati	= gps_baseinfo.latitude;
	cur_Coo.Longi	= gps_baseinfo.longitude;

	///电子围栏处理，需要将所有围栏都扫描一遍，可能有重叠的区域
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		if( Area_Para.area_info[i].area_data->State == AREA_Circular )
		{
			area_process_circular( &cur_Coo, &Area_Para.area_info[i] );
		}else if( Area_Para.area_info[i].area_data->State == AREA_Rectangle )
		{
			area_process_rectangle( &cur_Coo, &Area_Para.area_info[i] );
		}else if( Area_Para.area_info[i].area_data->State == AREA_Polygon )
		{
			area_process_polygon( &cur_Coo, &Area_Para.area_info[i] );
		}else
		{
			continue;
		}
	}
	///线路处理，如果当前位置在一个线路中，则跳出线路扫描
	for( i = 0; i < Area_Para.line_num; i++ )
	{
		if( area_process_line( &cur_Coo, &Area_Para.line_info[cur_line] ) )
		{
			break;
		}
		cur_line++;
		cur_line %= Area_Para.line_num;
	}
}

/*********************************************************************************
  *函数名称:void area_process_ex(void)
  *功能描述:电子围栏和线路报警处理函数，该函数调用前需要首先调用一次函数"area_init",否则会异常。
  *输	入:	none
  *输	出:	none
  *返 回 值:none
  *作	者:白养民
  *创建日期:2013-07-01
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
void area_proces_ex( u32 Longi, u32 Lati, u16 speed )
{
	u16				i;
	TypeStruct_Coor cur_Coo;
	static u16		cur_line = 0;
	//static u16 cur_area = 0;
	//return;
	///获取当前位置
	cur_Coo.Lati	= Lati;
	cur_Coo.Longi	= Longi;
	test_speed		= speed;

	///电子围栏处理，需要将所有围栏都扫描一遍，可能有重叠的区域
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		if( Area_Para.area_info[i].area_data->State == AREA_Circular )
		{
			area_process_circular( &cur_Coo, &Area_Para.area_info[i] );
		}else if( Area_Para.area_info[i].area_data->State == AREA_Rectangle )
		{
			area_process_rectangle( &cur_Coo, &Area_Para.area_info[i] );
		}else if( Area_Para.area_info[i].area_data->State == AREA_Polygon )
		{
			area_process_polygon( &cur_Coo, &Area_Para.area_info[i] );
		}else
		{
			continue;
		}
	}
	///线路处理，如果当前位置在一个线路中，则跳出线路扫描
	for( i = 0; i < Area_Para.line_num; i++ )
	{
		if( area_process_line( &cur_Coo, &Area_Para.line_info[cur_line] ) )
		{
			break;
		}
		cur_line++;
		cur_line %= Area_Para.line_num;
	}
}

