icprog/705_1/GPS_TW705_V01/bsp/stm32f40x_car/applications/jt808_area.c
FINSH_FUNCTION_EXPORT( area_proces_ex, area_proces_ex );


/*********************************************************************************
  *函数名称:u32 area_get_alarm(u8 *pdestbuf,u16* len)
  *功能描述:电子围栏及线路报警获取，需要注意的是如果该函数的返回值不等于0，用户调用该
   函数后需要调用函数"rt_free()"将资源释放，防止内存泄露。
  *输	入:	none
  *输	出:		pdestbuf	:输出808协议标准命令0x0200的附加消息体部分
   len			:附加消息体的长度
  *返 回 值:	u32			:为0表示无报警，非0表示有报警，报警值对应808协议0x0200报警标记位
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 area_get_alarm_old( u8 *pdestbuf, u16* destbuflen )
{
	u16				i;
	u16				datalen		= 0;
	u32				retdata		= 0;
	u8				alarem_num	= 0;
	static u8		this_buf[256];
	Type_AREA_ALARM area_alarm;

	*destbuflen = 0;

	pdestbuf = this_buf;

	///其它报警
	for(;; )
	{
		if( RT_EOK == rt_mq_recv( &mq_area, (void*)&area_alarm, sizeof( Type_AREA_ALARM ), RT_WAITING_NO ) )
		{
			retdata |= BIT( area_alarm.alarm_bit );
			memcpy( pdestbuf + datalen, &area_alarm.attri_id, area_alarm.len + 2 );
			datalen += area_alarm.len + 2;
		}else
		{
			break;
		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}
	///电子围栏超速报警
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		if( Area_Para.area_info[i].speed )
		{
			retdata |= BIT( 13 );
			///附加信息 ID  1BYTE
			pdestbuf[datalen++] = 0x11;
			///附加信息长度  1BYTE
			pdestbuf[datalen++] = 5;
			////位置类型  1BYTE
			pdestbuf[datalen++] = Area_Para.area_info[i].area_data->State;
			///区域或路段ID  DWORD
			data_to_buf( pdestbuf + datalen, Area_Para.area_info[i].area_data->ID, 4 );
			datalen += 4;
			alarem_num++;
		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}
	///线路超速报警
	for( i = 0; i < Area_Para.line_num; i++ )
	{
		if( Area_Para.line_info[i].speed )
		{
			retdata |= BIT( 13 );
			///附加信息 ID  1BYTE
			pdestbuf[datalen++] = 0x11;
			///附加信息长度  1BYTE
			pdestbuf[datalen++] = 5;
			////位置类型  1BYTE
			pdestbuf[datalen++] = AREA_Line;
			///区域或路段ID  DWORD
			data_to_buf( pdestbuf + datalen, Area_Para.line_info[i].road_id, 4 );
			datalen += 4;
			alarem_num++;
		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}

FUNC_RET:
	*destbuflen = datalen;
	return retdata;
}




/*********************************************************************************
  *函数名称:u32 area_get_alarm(u8 *pdestbuf,u16* len)
  *功能描述:电子围栏及线路报警获取，需要注意的是如果该函数的返回值不等于0，用户调用该
   函数后需要调用函数"rt_free()"将资源释放，防止内存泄露。
  *输	入:	none
  *输	出:		pdestbuf	:输出808协议标准命令0x0200的附加消息体部分
   len			:附加消息体的长度
  *返 回 值:	u32			:为0表示无报警，非0表示有报警，报警值对应808协议0x0200报警标记位
  *作	者:白养民
  *创建日期:2013-06-25
  *---------------------------------------------------------------------------------
  *修 改 人:
  *修改日期:
  *修改描述:
*********************************************************************************/
u32 area_get_alarm( u8 *pdestbuf, u16* destbuflen )
{
	u16				i;
	u16				datalen		= 0;
	u32				retdata		= 0;
	u8				alarem_num	= 0;
	static u8		this_buf[256];
	Type_AREA_ALARM area_alarm;

	*destbuflen = 0;

	pdestbuf = this_buf;

	///其它报警
	for(i=0;i<AREA_ALARM_NUM;i++)
	{
		///找到第一个空的区域
 		if(( area_alarm_array[i].attri_id )&&(area_alarm_array[i].alarm_bit & 0x80))
 		{
 			retdata |= BIT( area_alarm_array[i].alarm_bit & 0x1F );
			memcpy( pdestbuf + datalen, &area_alarm_array[i].attri_id, area_alarm_array[i].len + 2 );
			datalen += area_alarm_array[i].len + 2;
 		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}
	///电子围栏超速报警
	for( i = 0; i < Area_Para.area_num; i++ )
	{
		if( Area_Para.area_info[i].speed )
		{
			retdata |= BIT( 13 );
			///附加信息 ID  1BYTE
			pdestbuf[datalen++] = 0x11;
			///附加信息长度  1BYTE
			pdestbuf[datalen++] = 5;
			////位置类型  1BYTE
			pdestbuf[datalen++] = Area_Para.area_info[i].area_data->State;
			///区域或路段ID  DWORD
			data_to_buf( pdestbuf + datalen, Area_Para.area_info[i].area_data->ID, 4 );
			datalen += 4;
			alarem_num++;
		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}
	///线路超速报警
	for( i = 0; i < Area_Para.line_num; i++ )
	{
		if( Area_Para.line_info[i].speed )
		{
			retdata |= BIT( 13 );
			///附加信息 ID  1BYTE
			pdestbuf[datalen++] = 0x11;
			///附加信息长度  1BYTE
			pdestbuf[datalen++] = 5;
			////位置类型  1BYTE
			pdestbuf[datalen++] = AREA_Line;
			///区域或路段ID  DWORD
			data_to_buf( pdestbuf + datalen, Area_Para.line_info[i].road_id, 4 );
			datalen += 4;
			alarem_num++;
		}
		if( datalen >= 240 )
		{
			goto FUNC_RET;
		}
	}

FUNC_RET:
	*destbuflen = datalen;
	return retdata;
}

/************************************** The End Of File **************************************/
